Model: "model"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 28, 28, 1)]  0                                            
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 14, 14, 32)   320         input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 14, 14, 32)   128         conv2d[0][0]                     
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 7, 7, 64)     18496       batch_normalization[0][0]        
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 7, 7, 64)     256         conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 7, 7, 64)     36928       batch_normalization_1[0][0]      
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 7, 7, 64)     256         conv2d_2[0][0]                   
__________________________________________________________________________________________________
dropout (Dropout)               (None, 7, 7, 64)     0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 7, 7, 64)     36928       dropout[0][0]                    
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 7, 7, 64)     256         conv2d_3[0][0]                   
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 7, 7, 64)     0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 7, 7, 64)     36928       dropout_1[0][0]                  
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 7, 7, 64)     256         conv2d_4[0][0]                   
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 7, 7, 64)     0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 7, 7, 64)     36928       dropout_2[0][0]                  
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 7, 7, 64)     256         conv2d_5[0][0]                   
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 7, 7, 64)     0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 7, 7, 64)     36928       dropout_3[0][0]                  
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 7, 7, 64)     256         conv2d_6[0][0]                   
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 7, 7, 64)     0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 7, 7, 64)     36928       dropout_4[0][0]                  
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 7, 7, 64)     256         conv2d_7[0][0]                   
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, 7, 7, 64)     0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 7, 7, 64)     36928       dropout_5[0][0]                  
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 7, 7, 64)     256         conv2d_8[0][0]                   
__________________________________________________________________________________________________
dropout_6 (Dropout)             (None, 7, 7, 64)     0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 7, 7, 64)     36928       dropout_6[0][0]                  
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 7, 7, 64)     256         conv2d_9[0][0]                   
__________________________________________________________________________________________________
dropout_7 (Dropout)             (None, 7, 7, 64)     0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
flatten (Flatten)               (None, 3136)         0           dropout_7[0][0]                  
__________________________________________________________________________________________________
dense (Dense)                   (None, 2)            6274        flatten[0][0]                    
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 2)            6274        flatten[0][0]                    
__________________________________________________________________________________________________
lambda (Lambda)                 (None, 2)            0           dense[0][0]                      
                                                                 dense_1[0][0]                    
==================================================================================================
Total params: 329,220
Trainable params: 328,004
Non-trainable params: 1,216
__________________________________________________________________________________________________
None
Model: "model_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_2 (InputLayer)         [(None, 2)]               0         
_________________________________________________________________
dense_2 (Dense)              (None, 49)                147       
_________________________________________________________________
reshape (Reshape)            (None, 7, 7, 1)           0         
_________________________________________________________________
conv2d_transpose (Conv2DTran (None, 7, 7, 64)          640       
_________________________________________________________________
batch_normalization_10 (Batc (None, 7, 7, 64)          256       
_________________________________________________________________
conv2d_transpose_1 (Conv2DTr (None, 7, 7, 64)          36928     
_________________________________________________________________
batch_normalization_11 (Batc (None, 7, 7, 64)          256       
_________________________________________________________________
conv2d_transpose_2 (Conv2DTr (None, 7, 7, 64)          36928     
_________________________________________________________________
batch_normalization_12 (Batc (None, 7, 7, 64)          256       
_________________________________________________________________
conv2d_transpose_3 (Conv2DTr (None, 7, 7, 64)          36928     
_________________________________________________________________
batch_normalization_13 (Batc (None, 7, 7, 64)          256       
_________________________________________________________________
conv2d_transpose_4 (Conv2DTr (None, 7, 7, 64)          36928     
_________________________________________________________________
batch_normalization_14 (Batc (None, 7, 7, 64)          256       
_________________________________________________________________
conv2d_transpose_5 (Conv2DTr (None, 7, 7, 64)          36928     
_________________________________________________________________
batch_normalization_15 (Batc (None, 7, 7, 64)          256       
_________________________________________________________________
conv2d_transpose_6 (Conv2DTr (None, 7, 7, 64)          36928     
_________________________________________________________________
batch_normalization_16 (Batc (None, 7, 7, 64)          256       
_________________________________________________________________
conv2d_transpose_7 (Conv2DTr (None, 7, 7, 64)          36928     
_________________________________________________________________
batch_normalization_17 (Batc (None, 7, 7, 64)          256       
_________________________________________________________________
conv2d_transpose_8 (Conv2DTr (None, 14, 14, 64)        36928     
_________________________________________________________________
batch_normalization_18 (Batc (None, 14, 14, 64)        256       
_________________________________________________________________
conv2d_transpose_9 (Conv2DTr (None, 28, 28, 32)        18464     
_________________________________________________________________
batch_normalization_19 (Batc (None, 28, 28, 32)        128       
_________________________________________________________________
conv2d_transpose_10 (Conv2DT (None, 28, 28, 1)         289       
=================================================================
Total params: 317,396
Trainable params: 316,180
Non-trainable params: 1,216
_________________________________________________________________
None
Model: "model_2"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 28, 28, 1)]  0                                            
__________________________________________________________________________________________________
model (Functional)              [(None, 2), (None, 2 329220      input_1[0][0]                    
__________________________________________________________________________________________________
model_1 (Functional)            (None, 28, 28, 1)    317396      model[0][2]                      
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, 14, 14, 32)   320         input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 14, 14, 32)   128         conv2d[0][0]                     
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, 7, 7, 64)     18496       batch_normalization[0][0]        
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 7, 7, 64)     256         conv2d_1[0][0]                   
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, 7, 7, 64)     36928       batch_normalization_1[0][0]      
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 7, 7, 64)     256         conv2d_2[0][0]                   
__________________________________________________________________________________________________
dropout (Dropout)               (None, 7, 7, 64)     0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, 7, 7, 64)     36928       dropout[0][0]                    
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 7, 7, 64)     256         conv2d_3[0][0]                   
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 7, 7, 64)     0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, 7, 7, 64)     36928       dropout_1[0][0]                  
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 7, 7, 64)     256         conv2d_4[0][0]                   
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 7, 7, 64)     0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, 7, 7, 64)     36928       dropout_2[0][0]                  
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 7, 7, 64)     256         conv2d_5[0][0]                   
__________________________________________________________________________________________________
dropout_3 (Dropout)             (None, 7, 7, 64)     0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, 7, 7, 64)     36928       dropout_3[0][0]                  
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 7, 7, 64)     256         conv2d_6[0][0]                   
__________________________________________________________________________________________________
dropout_4 (Dropout)             (None, 7, 7, 64)     0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, 7, 7, 64)     36928       dropout_4[0][0]                  
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 7, 7, 64)     256         conv2d_7[0][0]                   
__________________________________________________________________________________________________
dropout_5 (Dropout)             (None, 7, 7, 64)     0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, 7, 7, 64)     36928       dropout_5[0][0]                  
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 7, 7, 64)     256         conv2d_8[0][0]                   
__________________________________________________________________________________________________
dropout_6 (Dropout)             (None, 7, 7, 64)     0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, 7, 7, 64)     36928       dropout_6[0][0]                  
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 7, 7, 64)     256         conv2d_9[0][0]                   
__________________________________________________________________________________________________
dropout_7 (Dropout)             (None, 7, 7, 64)     0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
flatten (Flatten)               (None, 3136)         0           dropout_7[0][0]                  
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 2)            6274        flatten[0][0]                    
__________________________________________________________________________________________________
dense (Dense)                   (None, 2)            6274        flatten[0][0]                    
__________________________________________________________________________________________________
tf.cast (TFOpLambda)            (None, 28, 28, 1)    0           input_1[0][0]                    
__________________________________________________________________________________________________
tf.convert_to_tensor (TFOpLambd (None, 28, 28, 1)    0           model_1[0][0]                    
__________________________________________________________________________________________________
tf.__operators__.add (TFOpLambd (None, 2)            0           dense_1[0][0]                    
__________________________________________________________________________________________________
tf.math.square (TFOpLambda)     (None, 2)            0           dense[0][0]                      
__________________________________________________________________________________________________
tf.keras.backend.binary_crossen (None, 28, 28, 1)    0           tf.cast[0][0]                    
                                                                 tf.convert_to_tensor[0][0]       
__________________________________________________________________________________________________
tf.math.subtract (TFOpLambda)   (None, 2)            0           tf.__operators__.add[0][0]       
                                                                 tf.math.square[0][0]             
__________________________________________________________________________________________________
tf.math.exp (TFOpLambda)        (None, 2)            0           dense_1[0][0]                    
__________________________________________________________________________________________________
tf.math.reduce_mean (TFOpLambda (None, 28, 28)       0           tf.keras.backend.binary_crossentr
__________________________________________________________________________________________________
tf.math.subtract_1 (TFOpLambda) (None, 2)            0           tf.math.subtract[0][0]           
                                                                 tf.math.exp[0][0]                
__________________________________________________________________________________________________
tf.math.reduce_sum (TFOpLambda) (None,)              0           tf.math.reduce_mean[0][0]        
__________________________________________________________________________________________________
tf.math.reduce_sum_1 (TFOpLambd (None,)              0           tf.math.subtract_1[0][0]         
__________________________________________________________________________________________________
tf.math.reduce_mean_1 (TFOpLamb ()                   0           tf.math.reduce_sum[0][0]         
__________________________________________________________________________________________________
tf.math.multiply (TFOpLambda)   (None,)              0           tf.math.reduce_sum_1[0][0]       
__________________________________________________________________________________________________
tf.__operators__.add_1 (TFOpLam (None,)              0           tf.math.reduce_mean_1[0][0]      
                                                                 tf.math.multiply[0][0]           
__________________________________________________________________________________________________
tf.math.reduce_mean_2 (TFOpLamb ()                   0           tf.__operators__.add_1[0][0]     
__________________________________________________________________________________________________
add_loss (AddLoss)              ()                   0           tf.math.reduce_mean_2[0][0]      
__________________________________________________________________________________________________
add_metric (AddMetric)          (None,)              0           tf.math.multiply[0][0]           
__________________________________________________________________________________________________
add_metric_1 (AddMetric)        ()                   0           tf.math.reduce_mean_1[0][0]      
==================================================================================================
Total params: 646,616
Trainable params: 644,184
Non-trainable params: 2,432
__________________________________________________________________________________________________
None
(25000, 28, 28, 1)
Predicting test-cases for data trained with 8. For the mono-case
Coverage: 100.00%
Predictability: 98.18%
Accuracy: 88.36%
Coverage generator: 100.00%
Predictability generator: 94.73%
Printing classes with anomalies
Anomalies: Number of class 0: 501
Anomalies: Number of class 2: 155
Anomalies: Number of class 3: 94
Anomalies: Number of class 4: 31
Anomalies: Number of class 5: 20
Anomalies: Number of class 6: 92
Anomalies: Number of class 7: 6
Anomalies: Number of class 8: 79
Anomalies: Number of class 9: 22
