Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, 28, 28, 1)]       0         
_________________________________________________________________
conv2d (Conv2D)              (None, 14, 14, 64)        640       
_________________________________________________________________
batch_normalization (BatchNo (None, 14, 14, 64)        256       
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 7, 7, 128)         73856     
_________________________________________________________________
batch_normalization_1 (Batch (None, 7, 7, 128)         512       
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 7, 7, 128)         147584    
_________________________________________________________________
batch_normalization_2 (Batch (None, 7, 7, 128)         512       
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 7, 7, 128)         147584    
_________________________________________________________________
batch_normalization_3 (Batch (None, 7, 7, 128)         512       
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 7, 7, 128)         147584    
_________________________________________________________________
batch_normalization_4 (Batch (None, 7, 7, 128)         512       
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 7, 7, 128)         147584    
_________________________________________________________________
batch_normalization_5 (Batch (None, 7, 7, 128)         512       
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 7, 7, 128)         147584    
_________________________________________________________________
batch_normalization_6 (Batch (None, 7, 7, 128)         512       
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 7, 7, 128)         147584    
_________________________________________________________________
batch_normalization_7 (Batch (None, 7, 7, 128)         512       
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 7, 7, 128)         147584    
_________________________________________________________________
batch_normalization_8 (Batch (None, 7, 7, 128)         512       
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 7, 7, 128)         147584    
_________________________________________________________________
batch_normalization_9 (Batch (None, 7, 7, 128)         512       
_________________________________________________________________
flatten (Flatten)            (None, 6272)              0         
_________________________________________________________________
dense (Dense)                (None, 2)                 12546     
=================================================================
Total params: 1,272,578
Trainable params: 1,270,146
Non-trainable params: 2,432
_________________________________________________________________
None
Model: "model_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_2 (InputLayer)         [(None, 2)]               0         
_________________________________________________________________
dense_1 (Dense)              (None, 49)                147       
_________________________________________________________________
reshape (Reshape)            (None, 7, 7, 1)           0         
_________________________________________________________________
conv2d_transpose (Conv2DTran (None, 7, 7, 128)         1280      
_________________________________________________________________
batch_normalization_10 (Batc (None, 7, 7, 128)         512       
_________________________________________________________________
conv2d_transpose_1 (Conv2DTr (None, 7, 7, 128)         147584    
_________________________________________________________________
batch_normalization_11 (Batc (None, 7, 7, 128)         512       
_________________________________________________________________
conv2d_transpose_2 (Conv2DTr (None, 7, 7, 128)         147584    
_________________________________________________________________
batch_normalization_12 (Batc (None, 7, 7, 128)         512       
_________________________________________________________________
conv2d_transpose_3 (Conv2DTr (None, 7, 7, 128)         147584    
_________________________________________________________________
batch_normalization_13 (Batc (None, 7, 7, 128)         512       
_________________________________________________________________
conv2d_transpose_4 (Conv2DTr (None, 7, 7, 128)         147584    
_________________________________________________________________
batch_normalization_14 (Batc (None, 7, 7, 128)         512       
_________________________________________________________________
conv2d_transpose_5 (Conv2DTr (None, 7, 7, 128)         147584    
_________________________________________________________________
batch_normalization_15 (Batc (None, 7, 7, 128)         512       
_________________________________________________________________
conv2d_transpose_6 (Conv2DTr (None, 7, 7, 128)         147584    
_________________________________________________________________
batch_normalization_16 (Batc (None, 7, 7, 128)         512       
_________________________________________________________________
conv2d_transpose_7 (Conv2DTr (None, 7, 7, 128)         147584    
_________________________________________________________________
batch_normalization_17 (Batc (None, 7, 7, 128)         512       
_________________________________________________________________
conv2d_transpose_8 (Conv2DTr (None, 14, 14, 128)       147584    
_________________________________________________________________
batch_normalization_18 (Batc (None, 14, 14, 128)       512       
_________________________________________________________________
conv2d_transpose_9 (Conv2DTr (None, 28, 28, 64)        73792     
_________________________________________________________________
batch_normalization_19 (Batc (None, 28, 28, 64)        256       
_________________________________________________________________
conv2d_transpose_10 (Conv2DT (None, 28, 28, 1)         577       
=================================================================
Total params: 1,261,332
Trainable params: 1,258,900
Non-trainable params: 2,432
_________________________________________________________________
None
Model: "model_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_3 (InputLayer)         [(None, 28, 28, 1)]       0         
_________________________________________________________________
model (Functional)           (None, 2)                 1272578   
_________________________________________________________________
model_1 (Functional)         (None, 28, 28, 1)         1261332   
=================================================================
Total params: 2,533,910
Trainable params: 2,529,046
Non-trainable params: 4,864
_________________________________________________________________
None
Finished training
(25000, 28, 28, 3)
Predicting test-cases for data trained without 8. For the color-case
Coverage: 72.90%
Predictability: 98.96%
Accuracy: 51.69%
Coverage generator: 75.80%
Predictability generator: 94.36%
(25000, 28, 28, 3)
Printing classes with anomalies
Anomalies: Number of class 045: 1
Anomalies: Number of class 066: 1
Anomalies: Number of class 088: 6
Anomalies: Number of class 185: 1
Anomalies: Number of class 188: 1
Anomalies: Number of class 208: 4
Anomalies: Number of class 220: 2
Anomalies: Number of class 238: 4
Anomalies: Number of class 258: 4
Anomalies: Number of class 288: 7
Anomalies: Number of class 348: 2
Anomalies: Number of class 362: 4
Anomalies: Number of class 383: 3
Anomalies: Number of class 388: 4
Anomalies: Number of class 408: 1
Anomalies: Number of class 528: 1
Anomalies: Number of class 580: 1
Anomalies: Number of class 588: 1
Anomalies: Number of class 688: 2
Anomalies: Number of class 780: 1
Anomalies: Number of class 788: 2
Anomalies: Number of class 807: 2
Anomalies: Number of class 822: 1
Anomalies: Number of class 833: 3
Anomalies: Number of class 834: 7
Anomalies: Number of class 840: 3
Anomalies: Number of class 868: 8
Anomalies: Number of class 880: 4
Anomalies: Number of class 883: 2
Anomalies: Number of class 908: 4
Anomalies: Number of class 968: 4
Anomalies: Number of class 987: 2
Anomalies: Number of class 988: 7
